[SQL Intro](<Session 1.pdf>)

### Assignment 1

**1. Create a database DEMO**

create database demo

**2. Create table EMP  with the following fields:**
- **EID NAME ADDR CITY DOB PHONE NO. EMAIL.  EID should be like  â€˜E0001'**

create table EMP
(
    EID char(5),
    NAME varchar(50),
    ADDR varchar(100),
    CITY varchar(30),
    DOB date,
    PHONE_NO varchar(20),
    EMAIL varchar(50)
)

**3.Insert 10 appropriate records in the Emp table**

insert into EMP
values
('E0001', 'Aarav Kumar', '402, Lotus Apartments, MG Road', 'Mumbai', '1990-05-21', '9876543210', 'aarav.kumar@gmail.com'),
('E0002', 'Priya Sharma', '1204, Shanti Towers, Sharda Path', 'Jaipur', '1987-11-30', '9988776655', 'priya.sharma@example.com'),
('E0003', 'Raj Malhotra', '78/79, East Street', 'Pune', '1992-02-15', '9123456789', 'raj.m@example.com'),
('E0004', 'Neha Singh', '305, Blue Ridge, Hinjewadi Phase 1', 'Pune', '1988-08-19', '9201234567', 'neha.singh@hotmail.com'),
('E0005', 'Kiran Bhatia', '196, Green Park', 'New Delhi', '1995-03-05', '9345678901', 'kiran.bhatia@example.com'),
('E0006', 'Anil Kapoor', '501, Marina Heights, Bandstand', 'Mumbai', '1993-07-17', '9456789012', 'anil.kapoor@outlook.com'),
('E0007', 'Sunita Goyal', '88C, MGRoad, Sector 14', 'Gurgaon', '1991-01-26', '9567890123', 'sunita.goyal@ymail.com'),
('E0008', 'Vishal Singh', '45, Lake View Colony', 'Hyderabad', '1989-09-10', '9678901234', 'vishal.s@libero.it'),
('E0009', 'Meena Das', '255, Red Hills', 'Kolkata', '1994-12-07', '9789012345', 'meena.das@gmail.com'),
('E0010', 'Amit Rao', '49, Sector 6, Pocket 5', 'Chennai', '1985-04-28', '9890123456', 'amit.rao@example.com');

**Value can be inserted also with mentioned columns.**

Insert into EMP (EID,NAME)
values
('E0001','Rakesh'),
('E0001','Arun);

**4.Use SELECT command to view the contents of emp table**

Select * from EMP